// https://leetcode.com/problems/sudoku-solver/description/
const size = 9;
const empty = '.';

// Проверяем, можно ли поставить выбранный value (от 1 до 9) в выбранную ячейку
const isValidNumber = (board, value, y, x) => {
  // Проверям, есть ли такое же значение в этой же колонке и ряду
  for (let i = 0; i < size; i++) {
    if (board[y][i] === value || board[i][x] === value) {
      return false;
    }
  }

  let startY = y - (y % 3);
  let startX = x - (x % 3);

  // Проверям, есть ли такое же значение в этой клетке (3*3)
  for (let y = startY; y < startY + 3; y++) {
    for (let x = startX; x < startX + 3; x++) {
      if (board[y][x] === value) {
        return false;
      }
    }
  }

  return true;
};

const solveSudoku = (board) => {
  // Перебираем каждую ячейку в доске по порядку
  for (let y = 0; y < size; y++) {
    for (let x = 0; x < size; x++) {
      const current = board[y][x];

      // Если в ячейке уже есть цифра, то идем дальше
      if (current !== empty) {
        continue;
      }

      // Если значение '.', то проверяем все значения от 1 до 9,  пробуем подставить в ячейку и рекурсивно заполняем остальные пустые ячейки
      for (let i = 1; i <= size; i++) {
        const isValid = isValidNumber(board, i.toString(), y, x);

        if (isValid) {
          board[y][x] = i.toString();
          const result = solveSudoku(board);

          // Если получили ссылку на доску, значит доска заполнена полностью
          if (result) {
            return result;
          }

          // В противном случае делаем вывод, что цифра не подходит для данной ячейки
          board[y][x] = empty;
        }
      }

      // Если ни одна из цифр не подходит для текущей ячейки, значит предыдущие ячейки мы заполнили некорректно
      return false;
    }
  }

  return board;
};

const board = [
  ['5', '3', '.', '.', '7', '.', '.', '.', '.'],
  ['6', '.', '.', '1', '9', '5', '.', '.', '.'],
  ['.', '9', '8', '.', '.', '.', '.', '6', '.'],
  ['8', '.', '.', '.', '6', '.', '.', '.', '3'],
  ['4', '.', '.', '8', '.', '3', '.', '.', '1'],
  ['7', '.', '.', '.', '2', '.', '.', '.', '6'],
  ['.', '6', '.', '.', '.', '.', '2', '8', '.'],
  ['.', '.', '.', '4', '1', '9', '.', '.', '5'],
  ['.', '.', '.', '.', '8', '.', '.', '7', '9'],
];

const board1 = [
  ['.', '.', '9', '7', '4', '8', '.', '.', '.'],
  ['7', '.', '.', '.', '.', '.', '.', '.', '.'],
  ['.', '2', '.', '1', '.', '9', '.', '.', '.'],
  ['.', '.', '7', '.', '.', '.', '2', '4', '.'],
  ['.', '6', '4', '.', '1', '.', '5', '9', '.'],
  ['.', '9', '8', '.', '.', '.', '3', '.', '.'],
  ['.', '.', '.', '8', '.', '3', '.', '2', '.'],
  ['.', '.', '.', '.', '.', '.', '.', '.', '6'],
  ['.', '.', '.', '2', '7', '5', '9', '.', '.'],
];
const board2 = [
  ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
  ['.', '9', '.', '.', '1', '.', '.', '3', '.'],
  ['.', '.', '6', '.', '2', '.', '7', '.', '.'],
  ['.', '.', '.', '3', '.', '4', '.', '.', '.'],
  ['2', '1', '.', '.', '.', '.', '.', '9', '8'],
  ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
  ['.', '.', '2', '5', '.', '6', '4', '.', '.'],
  ['.', '8', '.', '.', '.', '.', '.', '1', '.'],
  ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
];

// solveSudoku(board);
console.table(solveSudoku(board2));
